import pandas as pd
f=open('C:/Users/JIAPEI/Desktop/代码/up_data.csv') 
dataf=pd.read_csv(f) #加载数据集
g=open('C:/Users/JIAPEI/Desktop/代码/up_data_ex.csv',encoding='utf-8')
datag=pd.read_csv(g)


print(dataf.isnull())      #是否有空值，结果是有空值的地方显示为True，没有的显示为False
print(dataf.isnull().any())  #直接看每一列是否有空值，这个是只要这一列有1个空值，结果就是True
print(dataf.isnull().values==True)  #具体看哪几行有空值

dataf=dataf.drop(columns = ['videos'])  #删除列

type_name=['生活区','生活区','动画区','美食区','时尚区','游戏区','游戏区','美食区','游戏区','鬼畜区',
           '游戏区','游戏区','生活区','影视区','美食区','鬼畜区','美食区','游戏区','科技区','动画区',
           '美食区','动画区','游戏区','生活区','游戏区','游戏区','鬼畜区','游戏区','音乐区','生活区',
           '生活区','美食区','数码区','时尚区','音乐区','数码区','游戏区','游戏区','生活区','生活区',
           '音乐区','游戏区','影视区','音乐区','动画区','生活区','生活区','数码区','游戏区','生活区',
           '生活区','动画区','影视区','游戏区','音乐区','美食区','鬼畜区','美食区','动画区','生活区',
           '鬼畜区','游戏区','鬼畜区','鬼畜区','游戏区','影视区','音乐区','游戏区','游戏区','生活区',
           '时尚区','游戏区','生活区','游戏区','生活区','游戏区','游戏区','生活区','影视区','生活区',
           '生活区','生活区','美食区','舞蹈区','影视区','音乐区','游戏区','游戏区','美食区','美食区',
           '数码区','游戏区','数码区','鬼畜区','游戏区','舞蹈区','生活区','时尚区','游戏区','时尚区']
dataf['type']=type_name

work_sum1=['35','97','51','73','120','329','88','134','287','39',
           '114','78','113','78','136','76','113','85','55','69',
           '55','78','59','84','139','84','68','39','19','259',
           '62','239','66','47','34','377','116','194','49','71',
           '77','41','190','25','131','120','98','16','97','56',
           '82','84','191','66','13','69','33','104','152','91',
           '33','90','61','73','184','29','45','135','49','68',
           '70','58','32','59','126','212','274','98','26','14',
           '119','108','477','62','303','10','84','142','201','189',
           '238','184','82','6','105','17','186','49','169','64']
dataf['work_sum']=work_sum1


sec_type1=['美食圈','日常','综合','日常','美妆','电子竞技','单机游戏','美食圈','美食圈','鬼畜调教',
           '单机游戏','单机游戏','日常','影视杂谈','美食圈','鬼畜调教','美食圈','影视杂谈','趣味科普人文','综合',
           '美食圈','综合','单机游戏','动物圈','单机游戏','综合','人力VOCALOID','网络游戏','VOCALOID·UTAU','搞笑',
           '搞笑','美食圈','电脑装机','美妆','搞笑','手机平板','电子竞技','电子竞技','搞笑','日常',
           '翻唱','电子竞技','影视杂谈','翻唱','综合','日常','日常','手机平板','单机游戏','日常',
           '日常','综合','影视杂谈','单机游戏','演奏','美食圈','鬼畜调教','美食圈','综合','日常',
           '鬼畜调教','单机游戏','鬼畜调教','鬼畜调教','电子竞技','国产原创相关','翻唱','电子竞技','电子竞技','手工',
           '服饰','单机游戏','搞笑','单机游戏','搞笑','单机游戏','电子竞技','日常','影视杂谈','日常',
           '日常','搞笑','美食圈','日常','影视杂谈','翻唱','搞笑','单机游戏','美食圈','美食圈',
           '电脑装机','单机游戏','野生技术协会','鬼畜调教','网络游戏','宅舞','搞笑','健身','单机游戏','服饰']
dataf['sec_type']=sec_type1

outfile=pd.merge(datag,dataf)#合并两文件



outfile.to_csv('C:\\Users\\JIAPEI\\Desktop\\代码\\up_data_version1.csv',index=False)  #保存
